* To Release a new version
This is probably best run using ~ob-async~
#+NAME: base-version
#+BEGIN_EXAMPLE
1.0.0
#+END_EXAMPLE
** Base
Build the image 
#+begin_src bash
docker build ./base -t gitpod-base
#+end_src

Tag and release
#+begin_src bash :var version=base-version
docker tag gitpod-base justinbarclay/gitpod-base:$version
docker push justinbarclay/gitpod-base:$version
#+end_src

Now update all the other dockerfiles to use the newest Docker version
#+begin_src bash :var version=base-version
sed -i 's/gitpod-base:[0-9]\+.[0-9]\+.[0-9]\+/gitpod-base:$base-version/g' ./**/Dockerfile
#+end_src

** Doom
#+NAME: doom-version
#+BEGIN_EXAMPLE
1.0.0
#+END_EXAMPLE

Update the version in the docker file
#+begin_src bash
docker build ./doom -t gitpod-doom
#+end_src

#+begin_src bash :var doom_version=doom-version :async
docker tag gitpod-doom justinbarclay/gitpod-doom:$doom_version
docker push justinbarclay/gitpod-doom:$doom_version
#+end_src

** Spacemacs
#+NAME: spacemacs-version
#+BEGIN_EXAMPLE
1.0.0
#+END_EXAMPLE

Update the version in the docker file
#+begin_src bash :async
docker build ./spacemacs -t gitpod-spacemacs
#+end_src

#+begin_src bash :var spacemacs_version=spacemacs-version :async
docker tag gitpod-spacemacs justinbarclay/gitpod-spacemacs:$spacemacs_version
docker push justinbarclay/gitpod-spacemacs:$spacemacs_version
#+end_src


** Default
#+NAME: default-version
#+BEGIN_EXAMPLE
1.0.0
#+END_EXAMPLE

#+begin_src bash :var spacemacs_version=spacemacs-version :var doom_version=doom-version 
sed -i 's/yyoncho\/spacemacs:[0-9]\+.[0-9]\+.[0-9]\+/justinbarclay\/gitpod-spacemacs:$spacemacs_version/g' ./default/Dockerfile
sed -i 's/yyoncho\/gitpod-doom:[0-9]\+.[0-9]\+.[0-9]\+/justinbarclay\/gitpod-doom:$doom_version/g' ./default/Dockerfile
#+end_src

#+RESULTS:


Update the version in the docker file
#+begin_src bash
docker build ./default -t gitpod-default
#+end_src

#+begin_src bash :var default_version=default-version
docker tag gitpod-default justinbarclay/gitpod-default:$default_version
docker push justinbarclay/gitpod-default:$default_version
#+end_src

#+RESULTS:
| The           | push      | refers                                                                  | to     | repository | [docker.io/justinbarclay/gitpod-default] |
| 3f3cb570148f: | Preparing |                                                                         |        |            |                                          |
| 514b973ba980: | Preparing |                                                                         |        |            |                                          |
| 68fdabf5f071: | Preparing |                                                                         |        |            |                                          |
| 953a438598b1: | Preparing |                                                                         |        |            |                                          |
| 4ec9393ea749: | Preparing |                                                                         |        |            |                                          |
| acf43deeacf7: | Preparing |                                                                         |        |            |                                          |
| 79de70378bf5: | Preparing |                                                                         |        |            |                                          |
| ef39166bf3e4: | Preparing |                                                                         |        |            |                                          |
| 9548c099abd4: | Preparing |                                                                         |        |            |                                          |
| 3f3cb570148f: | Waiting   |                                                                         |        |            |                                          |
| bb3c460258fa: | Preparing |                                                                         |        |            |                                          |
| 514b973ba980: | Waiting   |                                                                         |        |            |                                          |
| bc33fd773969: | Preparing |                                                                         |        |            |                                          |
| b9870258af03: | Preparing |                                                                         |        |            |                                          |
| 313f91aff2fa: | Preparing |                                                                         |        |            |                                          |
| 79de70378bf5: | Waiting   |                                                                         |        |            |                                          |
| e352565fbe96: | Preparing |                                                                         |        |            |                                          |
| ef39166bf3e4: | Waiting   |                                                                         |        |            |                                          |
| 68fdabf5f071: | Waiting   |                                                                         |        |            |                                          |
| 4f39c3572f5c: | Preparing |                                                                         |        |            |                                          |
| 4ec9393ea749: | Waiting   |                                                                         |        |            |                                          |
| 7578d0601f2c: | Preparing |                                                                         |        |            |                                          |
| 953a438598b1: | Waiting   |                                                                         |        |            |                                          |
| 0ee0000e4cba: | Preparing |                                                                         |        |            |                                          |
| acf43deeacf7: | Waiting   |                                                                         |        |            |                                          |
| 455bc39abf47: | Preparing |                                                                         |        |            |                                          |
| 5f70bf18a086: | Preparing |                                                                         |        |            |                                          |
| bc33fd773969: | Waiting   |                                                                         |        |            |                                          |
| 5f70bf18a086: | Preparing |                                                                         |        |            |                                          |
| 9548c099abd4: | Waiting   |                                                                         |        |            |                                          |
| 3ee68f18d1ef: | Preparing |                                                                         |        |            |                                          |
| b9870258af03: | Waiting   |                                                                         |        |            |                                          |
| bb3c460258fa: | Waiting   |                                                                         |        |            |                                          |
| 9678a65d0b4b: | Preparing |                                                                         |        |            |                                          |
| 4f39c3572f5c: | Waiting   |                                                                         |        |            |                                          |
| 313f91aff2fa: | Waiting   |                                                                         |        |            |                                          |
| e352565fbe96: | Waiting   |                                                                         |        |            |                                          |
| 93a4f9d58f70: | Preparing |                                                                         |        |            |                                          |
| 0ee0000e4cba: | Waiting   |                                                                         |        |            |                                          |
| 39a474d52c41: | Preparing |                                                                         |        |            |                                          |
| 3ee68f18d1ef: | Waiting   |                                                                         |        |            |                                          |
| a800e507fdf6: | Preparing |                                                                         |        |            |                                          |
| 5f70bf18a086: | Waiting   |                                                                         |        |            |                                          |
| 93a4f9d58f70: | Waiting   |                                                                         |        |            |                                          |
| 5f70bf18a086: | Preparing |                                                                         |        |            |                                          |
| 8fe06da216f9: | Preparing |                                                                         |        |            |                                          |
| 39a474d52c41: | Waiting   |                                                                         |        |            |                                          |
| 4b2e63b31e4a: | Preparing |                                                                         |        |            |                                          |
| 5f70bf18a086: | Preparing |                                                                         |        |            |                                          |
| 5b8974b381d7: | Preparing |                                                                         |        |            |                                          |
| 256aae87931f: | Preparing |                                                                         |        |            |                                          |
| d9a6be1e2da9: | Preparing |                                                                         |        |            |                                          |
| 5d064a38ec24: | Preparing |                                                                         |        |            |                                          |
| 8d98a33803ed: | Preparing |                                                                         |        |            |                                          |
| fac6ae6fc159: | Preparing |                                                                         |        |            |                                          |
| b58ea24d0d16: | Preparing |                                                                         |        |            |                                          |
| 5f70bf18a086: | Preparing |                                                                         |        |            |                                          |
| 64e6a34e4638: | Preparing |                                                                         |        |            |                                          |
| e389b6304a79: | Preparing |                                                                         |        |            |                                          |
| 8fe06da216f9: | Waiting   |                                                                         |        |            |                                          |
| 1af74b3dc96f: | Preparing |                                                                         |        |            |                                          |
| 785f739f5ac2: | Preparing |                                                                         |        |            |                                          |
| 4b2e63b31e4a: | Waiting   |                                                                         |        |            |                                          |
| b1d2ecd714a3: | Preparing |                                                                         |        |            |                                          |
| 6fc20372fbeb: | Preparing |                                                                         |        |            |                                          |
| a551e190dc66: | Preparing |                                                                         |        |            |                                          |
| 5d064a38ec24: | Waiting   |                                                                         |        |            |                                          |
| 5b8974b381d7: | Waiting   |                                                                         |        |            |                                          |
| fac6ae6fc159: | Waiting   |                                                                         |        |            |                                          |
| 348eb0f81e26: | Preparing |                                                                         |        |            |                                          |
| 13b20bdc8396: | Preparing |                                                                         |        |            |                                          |
| a89ef148a909: | Preparing |                                                                         |        |            |                                          |
| b58ea24d0d16: | Waiting   |                                                                         |        |            |                                          |
| 256aae87931f: | Waiting   |                                                                         |        |            |                                          |
| d9a6be1e2da9: | Waiting   |                                                                         |        |            |                                          |
| 100c956fbd28: | Preparing |                                                                         |        |            |                                          |
| 8d98a33803ed: | Waiting   |                                                                         |        |            |                                          |
| e389b6304a79: | Waiting   |                                                                         |        |            |                                          |
| dfd473e39040: | Preparing |                                                                         |        |            |                                          |
| 1af74b3dc96f: | Waiting   |                                                                         |        |            |                                          |
| 97ac137ccf4e: | Preparing |                                                                         |        |            |                                          |
| b1d2ecd714a3: | Waiting   |                                                                         |        |            |                                          |
| 785f739f5ac2: | Waiting   |                                                                         |        |            |                                          |
| 64e6a34e4638: | Waiting   |                                                                         |        |            |                                          |
| 7a3f3d8744e4: | Preparing |                                                                         |        |            |                                          |
| a89ef148a909: | Waiting   |                                                                         |        |            |                                          |
| 7a3f3d8744e4: | Waiting   |                                                                         |        |            |                                          |
| 6fc20372fbeb: | Waiting   |                                                                         |        |            |                                          |
| 348eb0f81e26: | Waiting   |                                                                         |        |            |                                          |
| dfd473e39040: | Waiting   |                                                                         |        |            |                                          |
| a551e190dc66: | Waiting   |                                                                         |        |            |                                          |
| 100c956fbd28: | Waiting   |                                                                         |        |            |                                          |
| b1542dcfb321: | Preparing |                                                                         |        |            |                                          |
| b1542dcfb321: | Waiting   |                                                                         |        |            |                                          |
| 7a3f3d8744e4: | Waiting   |                                                                         |        |            |                                          |
| 716ae37dea94: | Preparing |                                                                         |        |            |                                          |
| 716ae37dea94: | Waiting   |                                                                         |        |            |                                          |
| b1542dcfb321: | Waiting   |                                                                         |        |            |                                          |
| f14a97fce699: | Preparing |                                                                         |        |            |                                          |
| f14a97fce699: | Waiting   |                                                                         |        |            |                                          |
| 716ae37dea94: | Waiting   |                                                                         |        |            |                                          |
| ff3f915d40bc: | Preparing |                                                                         |        |            |                                          |
| 2116456394b4: | Preparing |                                                                         |        |            |                                          |
| 2116456394b4: | Waiting   |                                                                         |        |            |                                          |
| f14a97fce699: | Waiting   |                                                                         |        |            |                                          |
| ff3f915d40bc: | Waiting   |                                                                         |        |            |                                          |
| 4985c0104220: | Preparing |                                                                         |        |            |                                          |
| fc687f7246eb: | Preparing |                                                                         |        |            |                                          |
| fc687f7246eb: | Waiting   |                                                                         |        |            |                                          |
| 2116456394b4: | Waiting   |                                                                         |        |            |                                          |
| 4985c0104220: | Waiting   |                                                                         |        |            |                                          |
| 021f6c76f910: | Preparing |                                                                         |        |            |                                          |
| 8b2fdcc42eff: | Preparing |                                                                         |        |            |                                          |
| 8b2fdcc42eff: | Waiting   |                                                                         |        |            |                                          |
| fc687f7246eb: | Waiting   |                                                                         |        |            |                                          |
| 021f6c76f910: | Waiting   |                                                                         |        |            |                                          |
| b102e7041f7a: | Preparing |                                                                         |        |            |                                          |
| abeec95c31d8: | Preparing |                                                                         |        |            |                                          |
| abeec95c31d8: | Waiting   |                                                                         |        |            |                                          |
| b102e7041f7a: | Waiting   |                                                                         |        |            |                                          |
| 8b2fdcc42eff: | Waiting   |                                                                         |        |            |                                          |
| 15c0477b5636: | Preparing |                                                                         |        |            |                                          |
| 15c0477b5636: | Waiting   |                                                                         |        |            |                                          |
| abeec95c31d8: | Waiting   |                                                                         |        |            |                                          |
| 9fdc2a98bb1f: | Preparing |                                                                         |        |            |                                          |
| 9fdc2a98bb1f: | Waiting   |                                                                         |        |            |                                          |
| 15c0477b5636: | Waiting   |                                                                         |        |            |                                          |
| 0a33e092ac69: | Preparing |                                                                         |        |            |                                          |
| 0a33e092ac69: | Waiting   |                                                                         |        |            |                                          |
| 9fdc2a98bb1f: | Waiting   |                                                                         |        |            |                                          |
| 16be8d0e7011: | Preparing |                                                                         |        |            |                                          |
| 16be8d0e7011: | Waiting   |                                                                         |        |            |                                          |
| 0a33e092ac69: | Waiting   |                                                                         |        |            |                                          |
| 95bf5848a072: | Preparing |                                                                         |        |            |                                          |
| 95bf5848a072: | Waiting   |                                                                         |        |            |                                          |
| 16be8d0e7011: | Waiting   |                                                                         |        |            |                                          |
| eadcf613a7ea: | Preparing |                                                                         |        |            |                                          |
| eadcf613a7ea: | Waiting   |                                                                         |        |            |                                          |
| 95bf5848a072: | Waiting   |                                                                         |        |            |                                          |
| b07cb3ff08ac: | Preparing |                                                                         |        |            |                                          |
| b07cb3ff08ac: | Waiting   |                                                                         |        |            |                                          |
| eadcf613a7ea: | Waiting   |                                                                         |        |            |                                          |
| e445a443a921: | Preparing |                                                                         |        |            |                                          |
| e445a443a921: | Waiting   |                                                                         |        |            |                                          |
| b07cb3ff08ac: | Waiting   |                                                                         |        |            |                                          |
| 4225c2df1d4d: | Preparing |                                                                         |        |            |                                          |
| 4225c2df1d4d: | Waiting   |                                                                         |        |            |                                          |
| e445a443a921: | Waiting   |                                                                         |        |            |                                          |
| 5f70bf18a086: | Preparing |                                                                         |        |            |                                          |
| 12274ba3a903: | Preparing |                                                                         |        |            |                                          |
| 8928622e07e1: | Preparing |                                                                         |        |            |                                          |
| 8928622e07e1: | Waiting   |                                                                         |        |            |                                          |
| 4225c2df1d4d: | Waiting   |                                                                         |        |            |                                          |
| 12274ba3a903: | Waiting   |                                                                         |        |            |                                          |
| b79540243cd6: | Preparing |                                                                         |        |            |                                          |
| b79540243cd6: | Waiting   |                                                                         |        |            |                                          |
| 8928622e07e1: | Waiting   |                                                                         |        |            |                                          |
| ee717e656f09: | Preparing |                                                                         |        |            |                                          |
| ee717e656f09: | Waiting   |                                                                         |        |            |                                          |
| b79540243cd6: | Waiting   |                                                                         |        |            |                                          |
| 355a39b259f6: | Preparing |                                                                         |        |            |                                          |
| 355a39b259f6: | Waiting   |                                                                         |        |            |                                          |
| ee717e656f09: | Waiting   |                                                                         |        |            |                                          |
| 92aba4706932: | Preparing |                                                                         |        |            |                                          |
| b9568c7424d8: | Preparing |                                                                         |        |            |                                          |
| 0b74b6ff022b: | Preparing |                                                                         |        |            |                                          |
| 0b74b6ff022b: | Waiting   |                                                                         |        |            |                                          |
| 355a39b259f6: | Waiting   |                                                                         |        |            |                                          |
| b9568c7424d8: | Waiting   |                                                                         |        |            |                                          |
| 92aba4706932: | Waiting   |                                                                         |        |            |                                          |
| c2a08c27aedc: | Preparing |                                                                         |        |            |                                          |
| c2a08c27aedc: | Waiting   |                                                                         |        |            |                                          |
| 0b74b6ff022b: | Waiting   |                                                                         |        |            |                                          |
| 5367f0d65a9c: | Preparing |                                                                         |        |            |                                          |
| 5367f0d65a9c: | Waiting   |                                                                         |        |            |                                          |
| c2a08c27aedc: | Waiting   |                                                                         |        |            |                                          |
| b40ed86654e5: | Preparing |                                                                         |        |            |                                          |
| b40ed86654e5: | Waiting   |                                                                         |        |            |                                          |
| 5367f0d65a9c: | Waiting   |                                                                         |        |            |                                          |
| b40ed86654e5: | Waiting   |                                                                         |        |            |                                          |
| 514b973ba980: | Pushed    |                                                                         |        |            |                                          |
| 3f3cb570148f: | Pushed    |                                                                         |        |            |                                          |
| 68fdabf5f071: | Pushed    |                                                                         |        |            |                                          |
| 953a438598b1: | Pushed    |                                                                         |        |            |                                          |
| 4ec9393ea749: | Pushed    |                                                                         |        |            |                                          |
| acf43deeacf7: | Pushed    |                                                                         |        |            |                                          |
| bc33fd773969: | Layer     | already                                                                 | exists |            |                                          |
| b9870258af03: | Layer     | already                                                                 | exists |            |                                          |
| ef39166bf3e4: | Pushed    |                                                                         |        |            |                                          |
| 9548c099abd4: | Pushed    |                                                                         |        |            |                                          |
| 313f91aff2fa: | Layer     | already                                                                 | exists |            |                                          |
| e352565fbe96: | Layer     | already                                                                 | exists |            |                                          |
| 4f39c3572f5c: | Layer     | already                                                                 | exists |            |                                          |
| 7578d0601f2c: | Layer     | already                                                                 | exists |            |                                          |
| 0ee0000e4cba: | Layer     | already                                                                 | exists |            |                                          |
| 455bc39abf47: | Layer     | already                                                                 | exists |            |                                          |
| 5f70bf18a086: | Layer     | already                                                                 | exists |            |                                          |
| 9678a65d0b4b: | Layer     | already                                                                 | exists |            |                                          |
| 93a4f9d58f70: | Layer     | already                                                                 | exists |            |                                          |
| 3ee68f18d1ef: | Layer     | already                                                                 | exists |            |                                          |
| 39a474d52c41: | Layer     | already                                                                 | exists |            |                                          |
| a800e507fdf6: | Layer     | already                                                                 | exists |            |                                          |
| 8fe06da216f9: | Layer     | already                                                                 | exists |            |                                          |
| 5b8974b381d7: | Layer     | already                                                                 | exists |            |                                          |
| 4b2e63b31e4a: | Layer     | already                                                                 | exists |            |                                          |
| 256aae87931f: | Layer     | already                                                                 | exists |            |                                          |
| 5d064a38ec24: | Layer     | already                                                                 | exists |            |                                          |
| d9a6be1e2da9: | Layer     | already                                                                 | exists |            |                                          |
| 8d98a33803ed: | Layer     | already                                                                 | exists |            |                                          |
| b58ea24d0d16: | Layer     | already                                                                 | exists |            |                                          |
| fac6ae6fc159: | Layer     | already                                                                 | exists |            |                                          |
| 64e6a34e4638: | Layer     | already                                                                 | exists |            |                                          |
| 1af74b3dc96f: | Layer     | already                                                                 | exists |            |                                          |
| e389b6304a79: | Layer     | already                                                                 | exists |            |                                          |
| 785f739f5ac2: | Layer     | already                                                                 | exists |            |                                          |
| b1d2ecd714a3: | Layer     | already                                                                 | exists |            |                                          |
| 6fc20372fbeb: | Layer     | already                                                                 | exists |            |                                          |
| a551e190dc66: | Layer     | already                                                                 | exists |            |                                          |
| 348eb0f81e26: | Layer     | already                                                                 | exists |            |                                          |
| a89ef148a909: | Layer     | already                                                                 | exists |            |                                          |
| 100c956fbd28: | Layer     | already                                                                 | exists |            |                                          |
| dfd473e39040: | Layer     | already                                                                 | exists |            |                                          |
| 97ac137ccf4e: | Layer     | already                                                                 | exists |            |                                          |
| 13b20bdc8396: | Layer     | already                                                                 | exists |            |                                          |
| 7a3f3d8744e4: | Layer     | already                                                                 | exists |            |                                          |
| b1542dcfb321: | Layer     | already                                                                 | exists |            |                                          |
| 716ae37dea94: | Layer     | already                                                                 | exists |            |                                          |
| f14a97fce699: | Layer     | already                                                                 | exists |            |                                          |
| ff3f915d40bc: | Layer     | already                                                                 | exists |            |                                          |
| 2116456394b4: | Layer     | already                                                                 | exists |            |                                          |
| 4985c0104220: | Layer     | already                                                                 | exists |            |                                          |
| fc687f7246eb: | Layer     | already                                                                 | exists |            |                                          |
| 021f6c76f910: | Layer     | already                                                                 | exists |            |                                          |
| 8b2fdcc42eff: | Layer     | already                                                                 | exists |            |                                          |
| b102e7041f7a: | Layer     | already                                                                 | exists |            |                                          |
| abeec95c31d8: | Layer     | already                                                                 | exists |            |                                          |
| 15c0477b5636: | Layer     | already                                                                 | exists |            |                                          |
| 9fdc2a98bb1f: | Layer     | already                                                                 | exists |            |                                          |
| 0a33e092ac69: | Layer     | already                                                                 | exists |            |                                          |
| 16be8d0e7011: | Layer     | already                                                                 | exists |            |                                          |
| 95bf5848a072: | Layer     | already                                                                 | exists |            |                                          |
| eadcf613a7ea: | Layer     | already                                                                 | exists |            |                                          |
| b07cb3ff08ac: | Layer     | already                                                                 | exists |            |                                          |
| e445a443a921: | Layer     | already                                                                 | exists |            |                                          |
| 4225c2df1d4d: | Layer     | already                                                                 | exists |            |                                          |
| 12274ba3a903: | Layer     | already                                                                 | exists |            |                                          |
| 8928622e07e1: | Layer     | already                                                                 | exists |            |                                          |
| b79540243cd6: | Layer     | already                                                                 | exists |            |                                          |
| ee717e656f09: | Layer     | already                                                                 | exists |            |                                          |
| 355a39b259f6: | Layer     | already                                                                 | exists |            |                                          |
| 92aba4706932: | Layer     | already                                                                 | exists |            |                                          |
| b9568c7424d8: | Layer     | already                                                                 | exists |            |                                          |
| 0b74b6ff022b: | Layer     | already                                                                 | exists |            |                                          |
| c2a08c27aedc: | Layer     | already                                                                 | exists |            |                                          |
| 5367f0d65a9c: | Layer     | already                                                                 | exists |            |                                          |
| b40ed86654e5: | Layer     | already                                                                 | exists |            |                                          |
| 79de70378bf5: | Pushed    |                                                                         |        |            |                                          |
| bb3c460258fa: | Pushed    |                                                                         |        |            |                                          |
| 1.0.0:        | digest:   | sha256:2dc5db53b80fd1b48c50a81bee20001820038ed537a6f6f92eb1930aa620ac8a | size:  |      17716 |                                          |

